[
  {
    "name": "George Orwell",
    "profilePic": "https://images.gr-assets.com/authors/1588856560p5/3706.jpg",
    "description": "Eric Arthur Blair was an English novelist, poet, essayist, journalist and critic who wrote under the pen name of George Orwell. His work is characterised by lucid prose, social criticism, opposition to all totalitarianism (both fascism and stalinism), and support of democratic socialism.\n\nOrwell is best known for his allegorical novella Animal Farm (1945) and the dystopian novel Nineteen Eighty-Four (1949), although his works also encompass literary criticism, poetry, fiction and polemical journalism. His non-fiction works, including The Road to Wigan Pier (1937), documenting his experience of working-class life in the industrial north of England, and Homage to Catalonia (1938), an account of his experiences soldiering for the Republican faction of the Spanish Civil War (1936–1939), are as critically respected as his essays on politics, literature, language and culture.\n\nOrwell's work remains influential in popular culture and in political culture, and the adjective \"Orwellian\"—describing totalitarian and authoritarian social practices—is part of the English language, like many of his neologisms, such as \"Big Brother\", \"Thought Police\", \"Room 101\", \"Newspeak\", \"memory hole\", \"doublethink\", and \"thoughtcrime\". In 2008, The Times named Orwell the second-greatest British writer since 1945."
  },
  {
    "name": "Harper Lee",
    "profilePic": "https://images.gr-assets.com/authors/1593873322p8/1825.jpg",
    "description": "Nelle Harper Lee was an American novelist whose 1960 novel To Kill a Mockingbird won the 1961 Pulitzer Prize and became a classic of modern American literature. She assisted her close friend Truman Capote in his research for the book In Cold Blood (1966). Her second and final novel, Go Set a Watchman, was an earlier draft of Mockingbird, set at a later date, that was published in July 2015 as a sequel.\nThe plot and characters of To Kill a Mockingbird are loosely based on Lee's observations of her family and neighbors in Monroeville, Alabama, as well as a childhood event that occurred near her hometown in 1936. The novel deals with racist attitudes, the irrationality of adult attitudes towards race and class in the Deep South of the 1930s, as depicted through the eyes of two children.\nLee received numerous accolades and honorary degrees, including the Presidential Medal of Freedom in 2007, which was awarded for her contribution to literature."
  },
  {
    "name": "Suzanne Collins",
    "profilePic": "https://images.gr-assets.com/authors/1630199330p8/153394.jpg",
    "description": "Since 1991, Suzanne Collins has been busy writing for children’s television. She has worked on the staffs of several Nickelodeon shows, including the Emmy-nominated hit Clarissa Explains it All and The Mystery Files of Shelby Woo. For preschool viewers, she penned multiple stories for the Emmy-nominated Little Bear and Oswald. She also co-wrote the critically acclaimed Rankin/Bass Christmas special, Santa, Baby! Most recently she was the Head Writer for Scholastic Entertainment’s Clifford’s Puppy Days.\n\nWhile working on a Kids WB show called Generation O! she met children’s author James Proimos, who talked her into giving children’s books a try.\n\nThinking one day about Alice in Wonderland, she was struck by how pastoral the setting must seem to kids who, like her own, lived in urban surroundings. In New York City, you’re much more likely to fall down a manhole than a rabbit hole and, if you do, you’re not going to find a tea party. What you might find...? Well, that’s the story of Gregor the Overlander, the first book in her five-part series, The Underland Chronicles. Suzanne also has a rhyming picture book illustrated by Mike Lester entitled When Charlie McButton Lost Power.\n\nShe currently lives in Connecticut with her family and a pair of feral kittens they adopted from their backyard.\n\nThe books she is most successful for in teenage eyes are The Hunger Games, Catching Fire and Mockingjay. These books have won several awards, including the GA Peach Award.\n"
  },
  {
    "name": "Jane Austen",
    "profilePic": "https://images.gr-assets.com/authors/1651510251p8/1265.jpg",
    "description": "Jane Austen was an English novelist known primarily for her six novels, which implicitly interpret, critique, and comment upon the English landed gentry at the end of the 18th century. Austen's plots often explore the dependence of women on marriage for the pursuit of favourable social standing and economic security. Her works are an implicit critique of the novels of sensibility of the second half of the 18th century and are part of the transition to 19th-century literary realism. Her deft use of social commentary, realism and biting irony have earned her acclaim among critics and scholars.\n\nThe anonymously published Sense and Sensibility (1811), Pride and Prejudice (1813), Mansfield Park (1814), and Emma (1816), were a modest success but brought her little fame in her lifetime. She wrote two other novels—Northanger Abbey and Persuasion, both published posthumously in 1817—and began another, eventually titled Sanditon, but died before its completion. She also left behind three volumes of juvenile writings in manuscript, the short epistolary novel Lady Susan, and the unfinished novel The Watsons.\n\nSince her death Austen's novels have rarely been out of print. A significant transition in her reputation occurred in 1833, when they were republished in Richard Bentley's Standard Novels series (illustrated by Ferdinand Pickering and sold as a set). They gradually gained wide acclaim and popular readership. In 1869, fifty-two years after her death, her nephew's publication of A Memoir of Jane Austen introduced a compelling version of her writing career and supposedly uneventful life to an eager audience. Her work has inspired a large number of critical essays and has been included in many literary anthologies. Her novels have also inspired many films, including 1940's Pride and Prejudice, 1995's Sense and Sensibility and 2016's Love & Friendship."
  },
  {
    "name": "Antoine de Saint-Exupéry",
    "profilePic": "https://images.gr-assets.com/authors/1330853515p8/1020792.jpg",
    "description": "Antoine de Saint-Exupéry was a French writer, poet, aristocrat, journalist, and pioneering aviator. He is best known for his novella The Little Prince (Le Petit Prince) and for his lyrical aviation writings, including Night Flight (Vol de nuit) and Wind, Sand and Stars (Terre des hommes). Born into an aristocratic family in Lyon, France, Saint-Exupéry developed a passion for aviation at a young age and became a pilot in the French Air Force.\n\nSaint-Exupéry's literary works often reflect his experiences as a pilot and his philosophical musings on human nature, friendship, and the meaning of life. The Little Prince, published in 1943, is a poetic tale that explores themes of innocence, love, and the search for meaning through the eyes of a young prince who travels from planet to planet. The book has been translated into numerous languages and remains one of the most translated and best-selling books in the world.\n\nDuring World War II, Saint-Exupéry served as a reconnaissance pilot for the Free French Air Force. In 1944, he disappeared during a mission over the Mediterranean Sea, and his fate remained a mystery for many years. In 1998, a fisherman discovered a bracelet belonging to Saint-Exupéry near Marseille, confirming that he had crashed into the sea. His legacy as both a writer and aviator continues to inspire readers around the world."
  },
  {
    "name": "Agatha Christie",
    "profilePic": "https://images.gr-assets.com/authors/1589991473p8/123715.jpg",
    "description": "Agatha Christie also wrote romance novels under the pseudonym Mary Westmacott, and was occasionally published under the name Agatha Christie Mallowan.\n\nDame Agatha Mary Clarissa Christie, Lady Mallowan, DBE (née Miller) was an English writer known for her 66 detective novels and 14 short story collections, particularly those revolving around fictional detectives Hercule Poirot and Miss Marple. She also wrote the world's longest-running play, the murder mystery The Mousetrap, which has been performed in the West End of London since 1952. A writer during the \"Golden Age of Detective Fiction\", Christie has been called the \"Queen of Crime\". She also wrote six novels under the pseudonym Mary Westmacott. In 1971, she was made a Dame (DBE) by Queen Elizabeth II for her contributions to literature. Guinness World Records lists Christie as the best-selling fiction writer of all time, her novels having sold more than two billion copies.\n\nThis best-selling author of all time wrote 66 crime novels and story collections, fourteen plays, and six novels under a pseudonym in romance. Her books sold more than a billion copies in the English language and a billion in translation. According to Index Translationum, people translated her works into 103 languages at least, the most for an individual author. Of the most enduring figures in crime literature, she created Hercule Poirot and Miss Jane Marple. She atuhored The Mousetrap, the longest-running play in the history of modern theater."
  },
  {
    "name": "J.K. Rowling",
    "profilePic": "https://images.gr-assets.com/authors/1596216614p8/1077326.jpg",
    "description": "Although she writes under the pen name J.K. Rowling, pronounced like rolling, her name when her first Harry Potter book was published was simply Joanne Rowling. Anticipating that the target audience of young boys might not want to read a book written by a woman, her publishers demanded that she use two initials, rather than her full name. As she had no middle name, she chose K as the second initial of her pen name, from her paternal grandmother Kathleen Ada Bulgen Rowling. She calls herself Jo and has said, \"No one ever called me 'Joanne' when I was young, unless they were angry.\" Following her marriage, she has sometimes used the name Joanne Murray when conducting personal business. During the Leveson Inquiry she gave evidence under the name of Joanne Kathleen Rowling. In a 2012 interview, Rowling noted that she no longer cared that people pronounced her name incorrectly.\n\nRowling was born to Peter James Rowling, a Rolls-Royce aircraft engineer, and Anne Rowling (née Volant), on 31 July 1965 in Yate, Gloucestershire, England, 10 miles (16 km) northeast of Bristol. Her mother Anne was half-French and half-Scottish. Her parents first met on a train departing from King's Cross Station bound for Arbroath in 1964. They married on 14 March 1965. Her mother's maternal grandfather, Dugald Campbell, was born in Lamlash on the Isle of Arran. Her mother's paternal grandfather, Louis Volant, was awarded the Croix de Guerre for exceptional bravery in defending the village of Courcelles-le-Comte during the First World War.\n\nRowling's sister Dianne was born at their home when Rowling was 23 months old. The family moved to the nearby village Winterbourne when Rowling was four. She attended St Michael's Primary School, a school founded by abolitionist William Wilberforce and education reformer Hannah More. Her headmaster at St Michael's, Alfred Dunn, has been suggested as the inspiration for the Harry Potter headmaster Albus Dumbledore.\n\nAs a child, Rowling often wrote fantasy stories, which she would usually then read to her sister. She recalls that: \"I can still remember me telling her a story in which she fell down a rabbit hole and was fed strawberries by the rabbit family inside it. Certainly the first story I ever wrote down (when I was five or six) was about a rabbit called Rabbit. He got the measles and was visited by his friends, including a giant bee called Miss Bee.\" At the age of nine, Rowling moved to Church Cottage in the Gloucestershire village of Tutshill, close to Chepstow, Wales. When she was a young teenager, her great aunt, who Rowling said \"taught classics and approved of a thirst for knowledge, even of a questionable kind,\" gave her a very old copy of Jessica Mitford's autobiography, Hons and Rebels. Mitford became Rowling's heroine, and Rowling subsequently read all of her books."
  },
  {
    "name": "Sarah J. Maas",
    "profilePic": "https://images.gr-assets.com/authors/1582137198p8/3433047.jpg",
    "description": "Sarah J. Maas is the #1 bestselling author of the Throne of Glass, Court of Thorns and Roses, and Crescent City series. Her books have sold millions of copies and are published in thirty-eight languages. She lives in New York City with her family."
  },
  {
    "name": "Khaled Hosseini",
    "profilePic": "https://images.gr-assets.com/authors/1359753468p8/569.jpg",
    "description": "Hosseini was born in Kabul, Afghanistan, in 1965. In 1970 Hosseini and his family moved to Iran where his father worked for the Embassy of Afghanistan in Tehran. In 1973 Hosseini's family returned to Kabul, and Hosseini's youngest brother was born in July of that year.\nIn 1976, when Hosseini was 11 years old, Hosseini's father obtained a job in Paris, France, and moved the family there. They were unable to return to Afghanistan because of the Saur Revolution in which the PDPA communist party seized power through a bloody coup in April 1978. Instead, a year after the Soviet invasion of Afghanistan, in 1980 they sought political asylum in the United States and made their residence in San Jose, California.\nHosseini graduated from Independence High School in San Jose in 1984 and enrolled at Santa Clara University, where he earned a bachelor's degree in biology in 1988. The following year, he entered the University of California, San Diego, School of Medicine, where he earned his M.D. in 1993. He completed his residency in internal medicine at Cedars-Sinai Medical Center in Los Angeles in 1996. He practiced medicine for over ten years, until a year and a half after the release of The Kite Runner.\nHosseini is currently a Goodwill Envoy for the United Nations High Commissioner for Refugees (UNHCR). He has been working to provide humanitarian assistance in Afghanistan through the Khaled Hosseini Foundation. The concept for the foundation was inspired by the trip to Afghanistan that Hosseini made in 2007 with UNHCR."
  },
  {
    "name": "Oscar Wilde",
    "profilePic": "https://images.gr-assets.com/authors/1673611182p8/3565.jpg",
    "description": "Oscar Fingal O'Fflahertie Wills Wilde was an Irish poet and playwright. After writing in different forms throughout the 1880s, he became one of the most popular playwrights in London in the early 1890s. He is best remembered for his epigrams and plays, his novel The Picture of Dorian Gray, and his criminal conviction for gross indecency for homosexual acts.\nWilde's parents were Anglo-Irish intellectuals in Dublin. In his youth, Wilde learned to speak fluent French and German. At university, he read Greats; he demonstrated himself to be an exceptional classicist, first at Trinity College Dublin, then at Magdalen College, Oxford. He became associated with the emerging philosophy of aestheticism, led by two of his tutors, Walter Pater and John Ruskin. After university, Wilde moved to London into fashionable cultural and social circles.\nWilde tried his hand at various literary activities: he wrote a play, published a book of poems, lectured in the United States and Canada on \"The English Renaissance\" in art and interior decoration, and then returned to London where he lectured on his American travels and wrote reviews for various periodicals. Known for his biting wit, flamboyant dress and glittering conversational skill, Wilde became one of the best-known personalities of his day. At the turn of the 1890s, he refined his ideas about the supremacy of art in a series of dialogues and essays, and incorporated themes of decadence, duplicity, and beauty into what would be his only novel, The Picture of Dorian Gray (1890). Wilde returned to drama, writing Salome (1891) in French while in Paris, but it was refused a licence for England due to an absolute prohibition on the portrayal of Biblical subjects on the English stage. Undiscouraged, Wilde produced four society comedies in the early 1890s, which made him one of the most successful playwrights of late-Victorian London.\nAt the height of his fame and success, while An Ideal Husband (1895) and The Importance of Being Earnest (1895) were still being performed in London, Wilde issued a civil writ against John Sholto Douglas, the 9th Marquess of Queensberry for criminal libel. The Marquess was the father of Wilde's lover, Lord Alfred Douglas. The libel hearings unearthed evidence that caused Wilde to drop his charges and led to his own arrest and criminal prosecution for gross indecency with other males. The jury was unable to reach a verdict and so a retrial was ordered. In the second trial Wilde was convicted and sentenced to two years' hard labour, the maximum penalty, and was jailed from 1895 to 1897. During his last year in prison he wrote De Profundis (published posthumously in abridged form in 1905), a long letter that discusses his spiritual journey through his trials and is a dark counterpoint to his earlier philosophy of pleasure. On the day of his release, he caught the overnight steamer to France, never to return to Britain or Ireland. In France and Italy, he wrote his last work, The Ballad of Reading Gaol (1898), a long poem commemorating the harsh rhythms of prison life."
  },
  {
    "name": "Anne Frank",
    "profilePic": "https://images.gr-assets.com/authors/1343271406p8/3720.jpg",
    "description": "Annelies Marie Frank was a German-born Jewish girl who kept a diary documenting her life in hiding amid Nazi persecution during the German occupation of the Netherlands. A celebrated diarist, Frank described everyday life from her family's hiding place in an Amsterdam attic. She gained fame posthumously and became one of the most-discussed Jewish victims of the Holocaust with the 1947 publication of The Diary of a Young Girl (originally Het Achterhuis in Dutch, lit. 'the back house'; English: The Secret Annex), which documents her life in hiding from 1942 to 1944. It is one of the world's best-known books and has been the basis for several plays and films.\nFrank was born in Frankfurt, Germany, in 1929. In 1934, when she was four-and-a-half, Frank and her family moved to Amsterdam in the Netherlands after Adolf Hitler and the Nazi Party gained control over Germany. By May 1940, the family was trapped in Amsterdam by the German occupation of the Netherlands. Frank lost her German citizenship in 1941 and became stateless. Despite spending most of her life in the Netherlands and being a de facto Dutch national, she never officially became a Dutch citizen. As persecutions of the Jewish population increased in July 1942, the family went into hiding in concealed rooms behind a bookcase in the building where Frank's father, Otto Frank, worked. The hiding place is notably referred to as the \"secret annex\". Until the family's arrest by the Gestapo on 4 August 1944, Frank kept and regularly wrote in a diary she had received as a birthday present in 1942.\nFollowing their arrest, the Franks were transported to concentration camps. On 1 November 1944, Anne Frank and her sister, Margot, were transferred from Auschwitz to Bergen-Belsen concentration camp, where they died (presumably of typhus) a few months later. They were estimated by the Red Cross to have died in March, with Dutch authorities setting 31 March as the official date. Later research has alternatively suggested that they may have died in February or early March.\nOtto, the only Holocaust survivor in the Frank family, returned to Amsterdam after World War II to find that Anne's diary had been saved by his secretaries, Miep Gies and Bep Voskuijl. Moved by his daughter's repeated wishes to be an author, Otto Frank published her diary in 1947. It was translated from its original Dutch version and first published in English in 1952 as The Diary of a Young Girl, and has since been translated into over 70 languages."
  },
  {
    "name": "Elie Wiesel",
    "profilePic": "https://images.gr-assets.com/authors/1255518412p8/1049.jpg",
    "description": "Eliezer \"Elie\" Wiesel was a Romanian-born American writer, professor, political activist, Nobel laureate, and Holocaust survivor. He authored 57 books, written mostly in French and English, including Night, a work based on his experiences as a Jewish prisoner in the Auschwitz and Buchenwald concentration camps.\nIn his political activities Wiesel became a regular speaker on the subject of the Holocaust and remained a strong defender of human rights during his lifetime. He also advocated for many other causes like the state of Israel and against Hamas and victims of oppression including Soviet and Ethiopian Jews, the apartheid in South Africa, the Bosnian genocide, Sudan, the Kurds and the Armenian genocide, Argentina's Desaparecidos or Nicaragua's Miskito people.\nHe was a professor of the humanities at Boston University, which created the Elie Wiesel Center for Jewish Studies in his honor. He was involved with Jewish causes and human rights causes and helped establish the United States Holocaust Memorial Museum in Washington, D.C.\nWiesel was awarded various prestigious awards including the Nobel Peace Prize in 1986. He was a founding board member of the New York Human Rights Foundation and remained active in it throughout his life."
  },
  {
    "name": "Jon Krakauer",
    "profilePic": "https://images.gr-assets.com/authors/1430856379p8/1235.jpg",
    "description": "Jon Krakauer is an American writer and mountaineer, known for his books on the outdoors and on extreme sports. His 1996 book Into the Wild was adapted into a 2007 film of the same name directed by Sean Penn. His 1997 book Into Thin Air, an account of the disastrous 1996 Mount Everest expedition, was a bestseller and won the 1998 Pulitzer Prize for General Non-Fiction."
  }
]
