[
  {
    "title": "1984",
    "cover": "https://m.media-amazon.com/images/S/compressed.photo.goodreads.com/books/1657781256i/61439040.jpg",
    "bookOriginalTitle": "1984",
    "description": "A masterpiece of rebellion and imprisonment where war is peace freedom is slavery and Big Brother is watching. Thought Police, Big Brother, Orwellian - these words have entered our vocabulary because of George Orwell's classic dystopian novel 1984. The story of one man's Nightmare Odyssey as he pursues a forbidden love affair through a world ruled by warring states and a power structure that controls not only information but also individual thought and memory 1984 is a prophetic haunting tale More relevant than ever before 1984 exposes the worst crimes imaginable the destruction of truth freedom and individuality. With a foreword by Thomas Pynchon.",
    "published": "July 1, 2022",
    "pagesCount": "368",
    "format": "Paperback",
    "ISBN": "9780452284234",
    "ASIN": "B00A2MTYAI",
    "language": "English"
  },
  {
    "title": "1984",
    "cover": "https://m.media-amazon.com/images/S/compressed.photo.goodreads.com/books/1532714506i/40961427.jpg",
    "bookOriginalTitle": "1984",
    "description": "Among the seminal texts of the 20th century, Nineteen Eighty-Four is a rare work that grows more haunting as its futuristic purgatory becomes more real. Published in 1949, the book offers political satirist George Orwell's nightmarish vision of a totalitarian, bureaucratic world and one poor stiff's attempt to find individuality. The brilliance of the novel is Orwell's prescience of modern life—the ubiquity of television, the distortion of the language—and his ability to construct such a thorough version of hell. Required reading for students since it was published, it ranks among the most terrifying novels ever written.",
    "published": "September 3, 2013",
    "pagesCount": "298",
    "format": "ebook",
    "ASIN": "B0DWTVHT8T",
    "language": "English"
  },
  {
    "title": "To Kill a Mockingbird",
    "cover": "https://m.media-amazon.com/images/S/compressed.photo.goodreads.com/books/1612238791i/56916837.jpg",
    "bookOriginalTitle": "To Kill a Mockingbird",
    "description": "One of the best-loved stories of all time, To Kill a Mockingbird has been translated into more than forty languages, sold more than forty million copies worldwide, served as the basis for an enormously popular motion picture, and was voted one of the best novels of the twentieth century by librarians across the country. A gripping, heart-wrenching, and wholly remarkable coming-of-age tale in a South poisoned by virulent prejudice, it views a world of great beauty and savage iniquities through the eyes of a young girl, as her father — a crusading local lawyer — risks everything to defend a black man unjustly accused of a terrible crime.",
    "published": "February 1, 2021",
    "pagesCount": "323",
    "format": "Paperback",
    "ASIN": "B0FSJYYTRF",
    "language": "English"
  },
  {
    "title": "The Hunger Games",
    "cover": "https://m.media-amazon.com/images/S/compressed.photo.goodreads.com/books/1586722975i/2767052.jpg",
    "bookOriginalTitle": "The Hunger Games",
    "description": "Winning means fame and fortune. Losing means certain death. The Hunger Games have begun. . . .\n\nIn the ruins of a place once known as North America lies the nation of Panem, a shining Capitol surrounded by twelve outlying districts. The Capitol is harsh and cruel and keeps the districts in line by forcing them all to send one boy and one girl between the ages of twelve and eighteen to participate in the annual Hunger Games, a fight to the death on live TV.\n\nSixteen-year-old Katniss Everdeen regards it as a death sentence when she steps forward to take her sister's place in the Games. But Katniss has been close to dead before-and survival, for her, is second nature. Without really meaning to, she becomes a contender. But if she is to win, she will have to start making choices that weigh survival against humanity and life against love.",
    "published": "October 14, 2008",
    "pagesCount": "374",
    "format": "Hardcover",
    "ASIN": "0439023483",
    "ISBN": "9780439023481",
    "language": "English"
  },
  {
    "title": "Catching Fire",
    "cover": "https://m.media-amazon.com/images/S/compressed.photo.goodreads.com/books/1586722941i/6148028.jpg",
    "bookOriginalTitle": "Catching Fire",
    "description": "Sparks are igniting.\nFlames are spreading.\nAnd the Capitol wants revenge.\n\nAgainst all odds, Katniss Everdeen has won the Hunger Games. She and fellow District 12 tribute Peeta Mellark are miraculously still alive. Katniss should be relieved, happy even. After all, she has returned to her family and her longtime friend, Gale. Yet nothing is the way Katniss wishes it to be. Gale holds her at an icy distance. Peeta has turned his back on her completely. And there are whispers of a rebellion against the Capitol—a rebellion that Katniss and Peeta may have helped create.\n\nMuch to her shock, Katniss has fueled an unrest that she's afraid she cannot stop. And what scares her even more is that she's not entirely convinced she should try. As time draws near for Katniss and Peeta to visit the districts on the Capitol's cruel Victory Tour, the stakes are higher than ever. If they can't prove, without a shadow of a doubt, that they are lost in their love for each other, the consequences will be horrifying.\n\nIn Catching Fire, the second novel of the Hunger Games trilogy, Suzanne Collins continues the story of Katniss Everdeen, testing her more than ever before . . . and surprising readers at every turn.",
    "published": "September 1, 2009",
    "pagesCount": "391",
    "format": "Hardcover",
    "ASIN": "0439023491",
    "ISBN": "9780439023498",
    "language": "English"
  },
  {
    "title": "Pride and Prejudice",
    "cover": "https://m.media-amazon.com/images/S/compressed.photo.goodreads.com/books/1320399351i/1885.jpg",
    "bookOriginalTitle": "Pride and Prejudice",
    "description": "Since its immediate success in 1813, Pride and Prejudice has remained one of the most popular novels in the English language. Jane Austen called this brilliant work \"her own darling child\" and its vivacious heroine, Elizabeth Bennet, \"as delightful a creature as ever appeared in print.\" The romantic clash between the opinionated Elizabeth and her proud beau, Mr. Darcy, is a splendid performance of civilized sparring. And Jane Austen's radiant wit sparkles as her characters dance a delicate quadrille of flirtation and intrigue, making this book the most superb comedy of manners of Regency England.",
    "published": "June 22, 2023",
    "pagesCount": "279",
    "format": "Paperback",
    "ASIN": "1441341706",
    "ISBN": "9781441341709",
    "language": "English"
  },
  {
    "title": "Pride and Prejudice",
    "cover": "https://m.media-amazon.com/images/S/compressed.photo.goodreads.com/books/1487841905i/84979.jpg",
    "bookOriginalTitle": "Pride and Prejudice",
    "description": "Since its immediate success in 1813, Pride and Prejudice has remained one of the most popular novels in the English language. Jane Austen called this brilliant work \"her own darling child\" and its vivacious heroine, Elizabeth Bennet, \"as delightful a creature as ever appeared in print.\" The romantic clash between the opinionated Elizabeth and her proud beau, Mr. Darcy, is a splendid performance of civilized sparring. And Jane Austen's radiant wit sparkles as her characters dance a delicate quadrille of flirtation and intrigue, making this book the most superb comedy of manners of Regency England.",
    "published": "March 1, 2003",
    "pagesCount": "334",
    "format": "Paperback",
    "ASIN": "0553213105",
    "ISBN": "9780553213102",
    "language": "English"
  },
  {
    "title": "Pride and Prejudice",
    "cover": "https://m.media-amazon.com/images/S/compressed.photo.goodreads.com/books/1681804503i/129915654.jpg",
    "bookOriginalTitle": "Pride and Prejudice",
    "description": "Pride and Prejudice has charmed generations of readers for more than two centuries. Jane Austen's much-adapted novel is famed for its witty, spirited heroine, sensational romances, and deft remarks on the triumphs and pitfalls of social convention. Author Jane Austen (1775-1817) was an English novelist whose works of social realism achieved unprecedented critical and popular success, though Austen herself remained an anonymous writer throughout her life.",
    "published": "June 22, 2023",
    "pagesCount": "400",
    "format": "Hardcover",
    "ASIN": "B0FSJNYL5K",
    "language": "English"
  },
  {
    "title": "The Little Prince",
    "cover": "https://m.media-amazon.com/images/S/compressed.photo.goodreads.com/books/1367545443i/157993.jpg",
    "bookOriginalTitle": "Le Petit Prince",
    "description": "A pilot stranded in the desert awakes one morning to see, standing before him, the most extraordinary little fellow. \"Please,\" asks the stranger, \"draw me a sheep.\" And the pilot realizes that when life's events are too difficult to understand, there is no choice but to succumb to their mysteries. He pulls out pencil and paper... And thus begins this wise and enchanting fable that, in teaching the secret of what is really important in life, has changed forever the world for its readers.\n\nFew stories are as widely read and as universally cherished by children and adults alike as The Little Prince, presented here in a stunning new translation with carefully restored artwork. The definitive edition of a worldwide classic, it will capture the hearts of readers of all ages.",
    "published": "May 15, 2000",
    "pagesCount": "96",
    "format": "Hardcover",
    "ASIN": "0152023984",
    "ISBN": "9780152023980",
    "language": "English"
  },
  {
    "title": "And Then There Were None",
    "cover": "https://m.media-amazon.com/images/S/compressed.photo.goodreads.com/books/1638425885i/16299.jpg",
    "bookOriginalTitle": "And Then There Were None",
    "description": "First, there were ten—a curious assortment of strangers summoned as weekend guests to a little private island off the coast of Devon. Their host, an eccentric millionaire unknown to all of them, is nowhere to be found. All that the guests have in common is a wicked past they're unwilling to reveal—and a secret that will seal their fate. For each has been marked for murder. A famous nursery rhyme is framed and hung in every room of the mansion:\n\n\"Ten little boys went out to dine; One choked his little self and then there were nine. Nine little boys sat up very late; One overslept himself and then there were eight. Eight little boys traveling in Devon; One said he'd stay there then there were seven. Seven little boys chopping up sticks; One chopped himself in half and then there were six. Six little boys playing with a hive; A bumblebee stung one and then there were five. Five little boys going in for law; One got in Chancery and then there were four. Four little boys going out to sea; A red herring swallowed one and then there were three. Three little boys walking in the zoo; A big bear hugged one and then there were two. Two little boys sitting in the sun; One got frizzled up and then there was one. One little boy left all alone; He went out and hanged himself and then there were none.\"\n\nWhen they realize that murders are occurring as described in the rhyme, terror mounts. One by one they fall prey. Before the weekend is out, there will be none. Who has choreographed this dastardly scheme? And who will be left to tell the tale? Only the dead are above suspicion.",
    "published": "May 3, 2004",
    "pagesCount": "264",
    "format": "Paperback",
    "ASIN": "0312330871",
    "ISBN": "9780312330873",
    "language": "English"
  },
  {
    "title": "Harry Potter and the Sorcerer's Stone",
    "cover": "https://m.media-amazon.com/images/S/compressed.photo.goodreads.com/books/1474154022i/3.jpg",
    "bookOriginalTitle": "Harry Potter and the Sorcerer's Stone",
    "description": "\"Turning the envelope over, his hand trembling, Harry saw a purple wax seal bearing a coat of arms; a lion, an eagle, a badger and a snake surrounding a large letter 'H'.\"\n\nHarry Potter has never even heard of Hogwarts when the letters start dropping on the doormat at number four, Privet Drive. Addressed in green ink on yellowish parchment with a purple seal, they are swiftly confiscated by his grisly aunt and uncle. Then, on Harry's eleventh birthday, a great beetle-eyed giant of a man called Rubeus Hagrid bursts in with some astonishing news: Harry Potter is a wizard, and he has a place at Hogwarts School of Witchcraft and Wizardry. An incredible adventure is about to begin!",
    "published": "November 1, 2003",
    "pagesCount": "309",
    "format": "Hardcover",
    "ASIN": "0439554934",
    "ISBN": "9780439554930",
    "language": "English"
  },
  {
    "title": "Harry Potter and the Chamber of Secrets",
    "cover": "https://m.media-amazon.com/images/S/compressed.photo.goodreads.com/books/1474169725i/15881.jpg",
    "bookOriginalTitle": "Harry Potter and the Chamber of Secrets",
    "description": "Ever since Harry Potter had come home for the summer, the Dursleys had been so mean and hideous that all Harry wanted was to get back to the Hogwarts School for Witchcraft and Wizardry. But just as he’s packing his bags, Harry receives a warning from a strange impish creature who says that if Harry returns to Hogwarts, disaster will strike.\n\nAnd strike it does. For in Harry’s second year at Hogwarts, fresh torments and horrors arise, including an outrageously stuck-up new professor and a spirit who haunts the girls’ bathroom. But then the real trouble begins – someone is turning Hogwarts students to stone. Could it be Draco Malfoy, a more poisonous rival than ever? Could it possibly be Hagrid, whose mysterious past is finally told? Or could it be the one everyone at Hogwarts most suspects… Harry Potter himself!",
    "published": "June 2, 1999",
    "pagesCount": "352",
    "format": "Hardcover",
    "ASIN": "B00ES27LCQ",
    "language": "English"
  },
  {
    "title": "A Court of Thorns and Roses",
    "cover": "https://m.media-amazon.com/images/S/compressed.photo.goodreads.com/books/1620324329i/50659467.jpg",
    "bookOriginalTitle": "A Court of Thorns and Roses",
    "description": "When nineteen-year-old huntress Feyre kills a wolf in the woods, a terrifying creature arrives to demand retribution. Dragged to a treacherous magical land she knows about only from legends, Feyre discovers that her captor is not truly a beast, but one of the lethal, immortal faeries who once ruled her world.\n\nAt least, he’s not a beast all the time.\n\nAs she adapts to her new home, her feelings for the faerie, Tamlin, transform from icy hostility into a fiery passion that burns through every lie she’s been told about the beautiful, dangerous world of the Fae. But something is not right in the faerie lands. An ancient, wicked shadow is growing, and Feyre must find a way to stop it, or doom Tamlin—and his world—forever.\n\nFrom bestselling author Sarah J. Maas comes a seductive, breathtaking book that blends romance, adventure, and faerie lore into an unforgettable read.",
    "published": "June 2, 2020",
    "pagesCount": "419",
    "format": "Paperback",
    "ASIN": "1635575567",
    "ISBN": "9781635575569",
    "language": "English"
  },
  {
    "title": "The Kite Runner",
    "cover": "https://m.media-amazon.com/images/S/compressed.photo.goodreads.com/books/1579036753i/77203.jpg",
    "bookOriginalTitle": "The Kite Runner",
    "description": "1970s Afghanistan: Twelve-year-old Amir is desperate to win the local kite-fighting tournament and his loyal friend Hassan promises to help him. But neither of the boys can foresee what would happen to Hassan that afternoon, an event that is to shatter their lives. After the Russians invade and the family is forced to flee to America, Amir realises that one day he must return to an Afghanistan under Taliban rule to find the one thing that his new world cannot grant him: redemption.",
    "published": "May 1, 2004",
    "pagesCount": "371",
    "format": "Paperback",
    "ASIN": "159463193X",
    "ISBN": "9781594631931",
    "language": "English"
  },
  {
    "title": "The Diary of a Young Girl",
    "cover": "https://m.media-amazon.com/images/S/compressed.photo.goodreads.com/books/1560816565i/48855.jpg",
    "bookOriginalTitle": "Het Achterhuis",
    "description": "Discovered in the attic where she spent the final years of her life, Anne Frank’s Diary has become a timeless classic; a powerful reminder of the horrors of war and a moving testament to the resilience of the human spirit.\n\nIn 1942, as the Nazis occupied Holland, thirteen-year-old Anne Frank and her Jewish family fled their home in Amsterdam and went into hiding. For the next two years, until they were betrayed to the Gestapo, the Franks and another family lived in the cramped “Secret Annexe” of an old office building. Cut off from the outside world, they endured hunger, boredom, the strain of close quarters, and the constant fear of discovery and death.\n\nThrough it all, Anne documented her experiences in a diary filled with vivid observations. At times thoughtful, poignant, and even unexpectedly funny, her writing offers a remarkable window into the strength and vulnerability of the human spirit. It’s both a compelling self-portrait of a bright, spirited young woman and a heartbreaking glimpse of a life that should have been far longer.",
    "published": "July 1, 1993",
    "pagesCount": "283",
    "format": "Paperback",
    "ASIN": "B007Z332A0",
    "language": "English"
  },
  {
    "title": "Night",
    "cover": "https://m.media-amazon.com/images/S/compressed.photo.goodreads.com/books/1709507006i/1617.jpg",
    "bookOriginalTitle": "Un di Velt Hot Geshvign",
    "description": "Born in the town of Sighet, Transylvania, Elie Wiesel was a teenager when he and his family were taken from their home in 1944 to Auschwitz concentration camp, and then to Buchenwald. Night is the terrifying record of Elie Wiesel's memories of the death of his family, the death of his own innocence, and his despair as a deeply observant Jew confronting the absolute evil of man. This new translation by his wife and most frequent translator, Marion Wiesel, corrects important details and presents the most accurate rendering in English of Elie Wiesel's testimony to what happened in the camps and of his unforgettable message that this horror must simply never be allowed to happen again.",
    "published": "January 16, 2006",
    "pagesCount": "120",
    "format": "Paperback",
    "ASIN": "0374500010",
    "ISBN": "9780374500016",
    "language": "English"
  },
  {
    "title": "Into the Wild",
    "cover": "https://m.media-amazon.com/images/S/compressed.photo.goodreads.com/books/1634587789i/1845.jpg",
    "bookOriginalTitle": "Into the Wild",
    "description": "In April, 1992, a young man from a well-to-do family hitchhiked to Alaska and walked alone into the wilderness north of Mt. McKinley. His name was Christopher Johnson McCandless. He had given $25,000 in savings to charity, abandoned his car and most of his possessions, burned all the cash in his wallet, and invented a new life for himself. Four months later, a party of moose hunters found his decomposed body. How McCandless came to die is the unforgettable story of Into the Wild.\n\nImmediately after graduating from college in 1991, McCandless had roamed through the West and Southwest on a vision quest like those made by his heroes Jack London and John Muir. In the Mojave Desert he abandoned his car, stripped it of its license plates, and burned all of his cash. He would give himself a new name, Alexander Supertramp, and, unencumbered by money and belongings, he would be free to wallow in the raw, unfiltered experiences that nature presented. Craving a blank spot on the map, McCandless simply threw away the maps. Leaving behind his desperate parents and sister, he vanished into the wild.",
    "published": "February 1, 1997",
    "pagesCount": "207",
    "format": "Paperback",
    "ASIN": "0385486804",
    "ISBN": "9780385486804",
    "language": "English"
  }
]
